# BGP

Схема BGP.png

## 1)  Заходим в режим конфигурирования роутера
en
conf t
## 2)  Cоздаем процесс BGP

```
R1(config)# router bgp 100
```
Вместо 100 можно выбрать число в диапозоне от 1 до 65535.
Теперь нам надо создать соседа BGP. 

```
R1(config-router)# neighbor 10.10.12.2 remote-as 100
R1(config-router)# neighbor 10.10.13.2 remote-as 100
```
ip-address — идентифицирует соседний маршрутизатор. Это тот адрес, который будет указан как получатель в BGP-пакетах.
remote-as— номер автономной системы соседа.
## 3) Теперь нам надо указать какие сети анонсированы по протоколу BGP

```
R1(config-router)# network 10.10.12.0 mask 255.255.255.0
R1(config-router)# network 10.10.13.0 mask 255.255.255.0
```
Команда neighbor указывает BGP кому анонсировать, а команда network — что анонсировать.
## 4) Настройка E-BGP
В ситуации с роутером R3 почти все тоже самое, только соседи будут:

```
R3(config-router)# neighbor 10.10.12.1 remote-as 100
R3(config-router)# neighbor 10.10.15.1 remote-as 100
```
И 

```
R3(config-router)# neighbor 10.10.14.2 remote-as 200
```
Т.к. соседний роутер R4 находится в автономной системе as200
На роутере R4 будет следующая настройка:
en
conf t
